## double check the following relative paths 
create_library_set -name tc -timing {./asap7sc7p5t_28/LIB/NLDM/asap7sc7p5t_AO_RVT_TT_nldm_211120.lib   ./asap7sc7p5t_28/LIB/NLDM/asap7sc7p5t_INVBUF_RVT_TT_nldm_220122.lib   ./asap7sc7p5t_28/LIB/NLDM/asap7sc7p5t_OA_RVT_TT_nldm_211120.lib   ./asap7sc7p5t_28/LIB/NLDM/asap7sc7p5t_SEQ_RVT_TT_nldm_220123.lib   ./asap7sc7p5t_28/LIB/NLDM/asap7sc7p5t_SIMPLE_RVT_TT_nldm_211120.lib}

create_constraint_mode -name sdc -sdc_files {./top.sdc}

#create_rc_corner -name rc_typ_25 -qx_tech_file ./asap7sc7p5t_28/qrc/qrcTechFile_typ03_unscaledV02 -T 25
create_rc_corner -name rc_typ_25 -qx_tech_file ./asap7sc7p5t_28/qrc/qrcTechFile_typ03_scaled4xV06 -T 25

create_delay_corner -name delay_tc -library_set {tc} -rc_corner {rc_typ_25}
create_analysis_view -name view_tc -constraint_mode {sdc} -delay_corner {delay_tc}
set_analysis_view -setup {view_tc} -hold {view_tc}

